#### Terraform Plan for live environment 📖 `success`

<details><summary>Show Plan</summary>

```

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mersthamcc/accounts-live/runs/run-LJfnJ5H3pJZEyDfF

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_password.end_of_day_password: Refreshing state... [id=none]
random_password.end_of_day_username: Refreshing state... [id=none]
aws_dynamodb_table.audit: Refreshing state... [id=live-audit]
aws_sqs_queue.transactions: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions.fifo]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:eu-west-2:947309733994:certificate/474dc888-5cfa-4ab9-a50d-781a930a44a6]
aws_api_gateway_rest_api.api: Refreshing state... [id=dvzs0cr2fi]
aws_iam_role.end_of_day_lambda_iam_role: Refreshing state... [id=live-end-of-day-lambda-role]
aws_iam_role.match_fee_lambda_iam_role: Refreshing state... [id=live-match-fee-lambda-role]
aws_iam_role.queue_processor_lambda_iam_role: Refreshing state... [id=live-queue-processor-lambda-role]
aws_iam_role.lambda_iam_role: Refreshing state... [id=live-standard-lambda-role]
aws_iam_policy.endpoint_logging_policy: Refreshing state... [id=arn:aws:iam::947309733994:policy/live-standard-lambda-logging]
aws_iam_role_policy_attachment.queue_processor_lambda_logs: Refreshing state... [id=live-queue-processor-lambda-role-20210721203943309800000007]
aws_iam_role_policy_attachment.end_of_day_lambda_logs: Refreshing state... [id=live-end-of-day-lambda-role-20210721203943143500000003]
aws_iam_role_policy_attachment.match_fee_lambda_logs: Refreshing state... [id=live-match-fee-lambda-role-20210725155508033900000002]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=live-standard-lambda-role-20210721203943141000000002]
aws_lambda_function.process_transactions_sqs_lambda: Refreshing state... [id=live-transaction-sqs-lambda]
module.end_of_day_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-end-of-day-lambda]
module.match_fee_transfer_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-match-fee-transfer-lambda]
module.match_fee_transfer_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=g1ken0]
module.sage_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=6w8bcx]
module.end_of_day_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=5jwz1s]
module.sage_callback_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=8zfi9v]
time_sleep.wait_60_seconds: Refreshing state... [id=2021-07-20T23:15:10Z]
aws_route53_record.api_certificate_validation["api.accounting.mersthamcc.co.uk"]: Refreshing state... [id=Z0577271GSI0V6WKPVVN__fcfa245a7bc80ef625194fe777667542.api.accounting.mersthamcc.co.uk._CNAME]
module.end_of_day_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-5jwz1s-POST]
module.sage_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-6w8bcx-GET]
module.match_fee_transfer_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-g1ken0-POST]
module.sage_callback_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-8zfi9v-GET]
aws_dynamodb_table_item.test-config: Refreshing state... [id=config|id||live|]
aws_acm_certificate_validation.api: Refreshing state... [id=2021-07-21 20:40:00 +0000 UTC]
aws_sqs_queue_policy.process_transactions_queue_policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions.fifo]
aws_iam_policy.lambda_audit_dynamo_policy: Refreshing state... [id=arn:aws:iam::947309733994:policy/live-audit-lambda-dynamo-policy]
aws_iam_policy.lambda_dynamo_policy: Refreshing state... [id=arn:aws:iam::947309733994:policy/live-standard-lambda-dynamo-policy]
aws_iam_role_policy_attachment.queue_processor_lambda_audit_dynamo: Refreshing state... [id=live-queue-processor-lambda-role-20210721203953435000000008]
aws_iam_role_policy_attachment.end_of_day_lambda_dynamo: Refreshing state... [id=live-end-of-day-lambda-role-20210721203943151000000004]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=live-standard-lambda-role-20210721203943153800000005]
aws_iam_role_policy_attachment.queue_processor_lambda_dynamo: Refreshing state... [id=live-queue-processor-lambda-role-20210721203943304100000006]
aws_iam_role_policy_attachment.match_fee_lambda_dynamo: Refreshing state... [id=live-match-fee-lambda-role-20210725155508003400000001]
aws_cloudwatch_log_group.sqs_transactions_log_group: Refreshing state... [id=/aws/lambda/live-transaction-sqs-lambda]
module.end_of_day_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.end_of_day_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-5jwz1s-POST]
module.end_of_day_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-end-of-day-lambda]
module.match_fee_transfer_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-g1ken0-POST]
aws_lambda_event_source_mapping.lambda_sqs_mapping: Refreshing state... [id=18f12537-932d-45fa-bbf4-46fc6ae16457]
module.match_fee_transfer_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-match-fee-transfer-lambda]
module.match_fee_transfer_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_domain_name.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk]
module.sage_callback_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-callback-lambda]
aws_route53_record.api: Refreshing state... [id=Z0577271GSI0V6WKPVVN_api.accounting.mersthamcc.co.uk_A]
module.sage_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-lambda]
aws_cloudwatch_log_metric_filter.transaction_processing_skip_metric: Refreshing state... [id=live-transaction-processing-skips]
aws_cloudwatch_log_metric_filter.transaction_processing_error_metric: Refreshing state... [id=live-transaction-processing-errors]
aws_cloudwatch_log_metric_filter.transaction_processing_success_metric: Refreshing state... [id=live-transaction-processing-success]
module.sage_callback_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-8zfi9v-GET]
module.sage_callback_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-callback-lambda]
module.sage_callback_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-lambda]
module.sage_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-6w8bcx-GET]
module.sage_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.deployment: Refreshing state... [id=2efw4t]
aws_api_gateway_stage.api_stage: Refreshing state... [id=ags-dvzs0cr2fi-live]
aws_api_gateway_base_path_mapping.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk/]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_sqs_queue.transactions has been changed
  ~ resource "aws_sqs_queue" "transactions" {
        id                                = "https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions.fifo"
        name                              = "live-transactions.fifo"
      ~ policy                            = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                                "arn:aws:iam::947309733994:role/live-end-of-day-lambda-role",
                              + "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                            ]
                        }
                        # (4 unchanged elements hidden)
                    },
                    {
                        Action    = [
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::947309733994:role/live-queue-processor-lambda-role"
                        }
                        Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo"
                        Sid       = "ReceiveSQS"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags                              = {}
        # (14 unchanged attributes hidden)
    }
  # aws_lambda_function.process_transactions_sqs_lambda has been changed
  ~ resource "aws_lambda_function" "process_transactions_sqs_lambda" {
        id                             = "live-transaction-sqs-lambda"
      ~ reserved_concurrent_executions = -1 -> 1
        tags                           = {}
        # (20 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.audit_dynamo_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "audit_dynamo_policy_document"  {
      ~ id      = "1268634628" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:947309733994:table/live-audit"
                      - Sid      = "AllowAccessToDynamoTables"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.email_queue_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "email_queue_policy_document"  {
      ~ id      = "2266885179" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "sqs:SendMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                              - "arn:aws:iam::947309733994:role/live-end-of-day-lambda-role",
                            ]
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo"
                      - Sid       = "SendSQS"
                    },
                  - {
                      - Action    = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::947309733994:role/live-queue-processor-lambda-role"
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo"
                      - Sid       = "ReceiveSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo",
              ~ (known after apply),
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo",
              ~ (known after apply),
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_acm_certificate.api will be updated in-place
  ~ resource "aws_acm_certificate" "api" {
        id                        = "arn:aws:acm:eu-west-2:947309733994:certificate/474dc888-5cfa-4ab9-a50d-781a930a44a6"
        tags                      = {}
      ~ tags_all                  = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_domain_name.api will be updated in-place
  ~ resource "aws_api_gateway_domain_name" "api" {
        id                       = "api.accounting.mersthamcc.co.uk"
        tags                     = {}
      ~ tags_all                 = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_rest_api.api will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "api" {
        id                           = "dvzs0cr2fi"
        name                         = "live-accounting-http-api"
        tags                         = {}
      ~ tags_all                     = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "api_stage" {
        id                    = "ags-dvzs0cr2fi-live"
        tags                  = {}
      ~ tags_all              = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.sqs_transactions_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "sqs_transactions_log_group" {
        id                = "/aws/lambda/live-transaction-sqs-lambda"
        name              = "/aws/lambda/live-transaction-sqs-lambda"
        tags              = {}
      ~ tags_all          = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_dynamodb_table.audit will be updated in-place
  ~ resource "aws_dynamodb_table" "audit" {
        id             = "live-audit"
        name           = "live-audit"
        tags           = {}
      ~ tags_all       = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (6 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_dynamodb_table_item.test-config will be updated in-place
  ~ resource "aws_dynamodb_table_item" "test-config" {
        id         = "config|id||live|"
      ~ item       = (sensitive) -> (sensitive)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.endpoint_logging_policy will be updated in-place
  ~ resource "aws_iam_policy" "endpoint_logging_policy" {
        id          = "arn:aws:iam::947309733994:policy/live-standard-lambda-logging"
        name        = "live-standard-lambda-logging"
        tags        = {}
      ~ tags_all    = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_audit_dynamo_policy will be updated in-place
  ~ resource "aws_iam_policy" "lambda_audit_dynamo_policy" {
        id          = "arn:aws:iam::947309733994:policy/live-audit-lambda-dynamo-policy"
        name        = "live-audit-lambda-dynamo-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:947309733994:table/live-audit"
                      - Sid      = "AllowAccessToDynamoTables"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
      ~ tags_all    = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_dynamo_policy will be updated in-place
  ~ resource "aws_iam_policy" "lambda_dynamo_policy" {
        id          = "arn:aws:iam::947309733994:policy/live-standard-lambda-dynamo-policy"
        name        = "live-standard-lambda-dynamo-policy"
        tags        = {}
      ~ tags_all    = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.end_of_day_lambda_iam_role will be updated in-place
  ~ resource "aws_iam_role" "end_of_day_lambda_iam_role" {
        id                    = "live-end-of-day-lambda-role"
        name                  = "live-end-of-day-lambda-role"
        tags                  = {}
      ~ tags_all              = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.lambda_iam_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_iam_role" {
        id                    = "live-standard-lambda-role"
        name                  = "live-standard-lambda-role"
        tags                  = {}
      ~ tags_all              = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.match_fee_lambda_iam_role will be updated in-place
  ~ resource "aws_iam_role" "match_fee_lambda_iam_role" {
        id                    = "live-match-fee-lambda-role"
        name                  = "live-match-fee-lambda-role"
        tags                  = {}
      ~ tags_all              = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.queue_processor_lambda_iam_role will be updated in-place
  ~ resource "aws_iam_role" "queue_processor_lambda_iam_role" {
        id                    = "live-queue-processor-lambda-role"
        name                  = "live-queue-processor-lambda-role"
        tags                  = {}
      ~ tags_all              = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_event_source_mapping.lambda_sqs_mapping must be replaced
-/+ resource "aws_lambda_event_source_mapping" "lambda_sqs_mapping" {
      - bisect_batch_on_function_error     = false -> null
      ~ event_source_arn                   = "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo" -> (known after apply) # forces replacement
      ~ function_arn                       = "arn:aws:lambda:eu-west-2:947309733994:function:live-transaction-sqs-lambda" -> (known after apply)
      - function_response_types            = [] -> null
      ~ id                                 = "18f12537-932d-45fa-bbf4-46fc6ae16457" -> (known after apply)
      ~ last_modified                      = "2021-07-21T20:51:10Z" -> (known after apply)
      + last_processing_result             = (known after apply)
      - maximum_batching_window_in_seconds = 0 -> null
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
      - queues                             = [] -> null
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
      - topics                             = [] -> null
      - tumbling_window_in_seconds         = 0 -> null
      ~ uuid                               = "18f12537-932d-45fa-bbf4-46fc6ae16457" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_function.process_transactions_sqs_lambda will be updated in-place
  ~ resource "aws_lambda_function" "process_transactions_sqs_lambda" {
        id                             = "live-transaction-sqs-lambda"
        tags                           = {}
      ~ tags_all                       = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (20 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_sqs_queue.transactions must be replaced
-/+ resource "aws_sqs_queue" "transactions" {
      ~ arn                               = "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo" -> (known after apply)
      ~ deduplication_scope               = "queue" -> (known after apply)
      ~ fifo_queue                        = true -> false # forces replacement
      ~ fifo_throughput_limit             = "perQueue" -> (known after apply)
      ~ id                                = "https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions.fifo" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "live-transactions.fifo" -> "live-transactions" # forces replacement
      + name_prefix                       = (known after apply)
      ~ policy                            = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "sqs:SendMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::947309733994:role/live-end-of-day-lambda-role",
                              - "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                            ]
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo"
                      - Sid       = "SendSQS"
                    },
                  - {
                      - Action    = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::947309733994:role/live-queue-processor-lambda-role"
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo"
                      - Sid       = "ReceiveSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - tags                              = {} -> null
      ~ tags_all                          = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
      ~ url                               = "https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions.fifo" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.process_transactions_queue_policy must be replaced
-/+ resource "aws_sqs_queue_policy" "process_transactions_queue_policy" {
      ~ id        = "https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions.fifo" -> (known after apply)
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "sqs:SendMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::947309733994:role/live-end-of-day-lambda-role",
                              - "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                            ]
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo"
                      - Sid       = "SendSQS"
                    },
                  - {
                      - Action    = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::947309733994:role/live-queue-processor-lambda-role"
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions.fifo"
                      - Sid       = "ReceiveSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ queue_url = "https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions.fifo" -> (known after apply) # forces replacement
    }

  # module.end_of_day_endpoint.aws_cloudwatch_log_group.lambda_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda_log_group" {
        id                = "/aws/lambda/live-end-of-day-lambda"
        name              = "/aws/lambda/live-end-of-day-lambda"
        tags              = {}
      ~ tags_all          = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (2 unchanged attributes hidden)
    }

  # module.end_of_day_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-end-of-day-lambda"
        tags                           = {}
      ~ tags_all                       = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (26 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.match_fee_transfer_endpoint.aws_cloudwatch_log_group.lambda_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda_log_group" {
        id                = "/aws/lambda/live-match-fee-transfer-lambda"
        name              = "/aws/lambda/live-match-fee-transfer-lambda"
        tags              = {}
      ~ tags_all          = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (2 unchanged attributes hidden)
    }

  # module.match_fee_transfer_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-match-fee-transfer-lambda"
        tags                           = {}
      ~ tags_all                       = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (20 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.sage_callback_endpoint.aws_cloudwatch_log_group.lambda_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda_log_group" {
        id                = "/aws/lambda/live-sage-callback-lambda"
        name              = "/aws/lambda/live-sage-callback-lambda"
        tags              = {}
      ~ tags_all          = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sage_callback_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-sage-callback-lambda"
        tags                           = {}
      ~ tags_all                       = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (20 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.sage_endpoint.aws_cloudwatch_log_group.lambda_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda_log_group" {
        id                = "/aws/lambda/live-sage-lambda"
        name              = "/aws/lambda/live-sage-lambda"
        tags              = {}
      ~ tags_all          = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sage_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-sage-lambda"
        tags                           = {}
      ~ tags_all                       = {
          + "Application" = "Accounts"
          + "Environment" = "live"
        }
        # (20 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 23 to change, 3 to destroy.


```

</details>